ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Автотранспорт/УТЗ_ПЛ_Автотранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УТЗ_ПЛ_Автотранспорт</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПутевогоЛистаПоУмолчанию</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ВидыПутевыхЛистов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГаражныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнениеПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_МоделиАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобственнаяМасса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвтотранспорта</name>
    <type>
      <types>EnumRef.УТЗ_ПЛ_ТипыАвтотранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>Топливо</name>
    <type>
      <types>CatalogRef.УТЗ_ПЛ_Топливо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВодителей</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.УТЗ_ПЛ_Водители</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОсновнойВодитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыПутевыхЛистов/УТЗ_ПЛ_ВидыПутевыхЛистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыПутевыхЛистов</name>
  <enumValues>
    <name>Легковой</name>
  </enumValues>
  <enumValues>
    <name>Грузовой</name>
  </enumValues>
  <enumValues>
    <name>Строительный</name>
  </enumValues>
  <enumValues>
    <name>Специальный</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Enums/УТЗ_ПЛ_ВидыАвтотранспорта/УТЗ_ПЛ_ВидыАвтотранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УТЗ_ПЛ_ВидыАвтотранспорта</name>
  <enumValues>
    <name>ОсновнойТранспорт</name>
  </enumValues>
  <enumValues>
    <name>ПрицепыОборудованиеБезТопливногоБака</name>
  </enumValues>
  <enumValues>
    <name>ПрицепыОборудованиеСТопливнымБаком</name>
  </enumValues>
</mdclass:Enum>

ERP_Управление_предприятием_2_демо.УТЗ_ПутевыеЛисты/src/Catalogs/УТЗ_ПЛ_Автотранспорт/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоГруппа Тогда
		ВидПутевогоЛистаПоУмолчанию = Перечисления.УТЗ_ПЛ_ВидыПутевыхЛистов.Легковой;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	// Проверка на дубликаты наименований в справочнике (Сине-Никольский А.А.)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УТЗ_ПЛ_Автотранспорт КАК УТЗ_ПЛ_Автотранспорт
	|ГДЕ
	|	УТЗ_ПЛ_Автотранспорт.Ссылка <> &Ссылка
	|	И УТЗ_ПЛ_Автотранспорт.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		ОбщегоНазначения.СообщитьПользователю("Автотранспорт с таким наименованием уже есть в базе", Ссылка, "Наименование");
		Отказ = Истина;
	КонецЕсли;
	
	// Проверка на дубликаты в табличной части 
	ИсходныйМассив = СписокВодителей.Выгрузить(, "Водитель").ВыгрузитьКолонку("Водитель");
	МассивБезДубликатов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ИсходныйМассив);
	
	Если ИсходныйМассив.Количество() > МассивБезДубликатов.Количество() Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю("В табличной части есть повторяющиеся значения");
	КонецЕсли;
	
	// Проверка на заполнение реквизита "Топливо" для видов автотранспорта "Основной" и "С топливным баком"
	Если ВидАвтотранспорта = Перечисления.УТЗ_ПЛ_ВидыАвтотранспорта.ОсновнойТранспорт 
		Или ВидАвтотранспорта = Перечисления.УТЗ_ПЛ_ВидыАвтотранспорта.ПрицепыОборудованиеСТопливнымБаком Тогда
		
		Если Не ЗначениеЗаполнено(Топливо) Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю("Для указанного вида автотранспорта необходимо указать используемое топливо");
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
